## Intro to SQL

### Selecting Columns

####  Onboarding | Tables

In [1]:
# 5000 films
# films: id|title|release_year|country|duration|language|certification|gross|budget
# people: id|name|birthdate|deathdate
# reviews: id|film_id|num_user|num_critic|imdb_score|num_votes|facebook_likes
# roles: id|film_id|person_id|role

# who is the first person listed in the people table?
# 50 Cent

#### Onboarding | Query Result

In [2]:
# SELECT name FROM people;
# Who is the second person listed in the query result?
# A. Michael Baldwin

#### Onboarding | Errors

In [3]:
# error editing
# Two types of errors from code:
"""
-- Try running me!
'DataCamp <3 SQL'
AS result;

-- syntax error at or near "'DataCamp <3 SQL'" LINE 2: 'DataCamp <3 SQL' ^
"""
# fix error
"""
SELECT 'DataCamp <3 SQL'
AS result;
"""

"\nSELECT 'DataCamp <3 SQL'\nAS result;\n"

#### Onboarding | Multi-step Exercises

In [4]:
# 1/3
# submint query 
"""
SELECT 'SQL'
AS result;
"""
# 2/3
# change 'SQL' to 'SQL is'
"""
SELECT 'SQL is'
AS result;
"""
# 3/3
# change 'SQL is' to 'SQL is cool'
"""
SELECT 'SQL is cool'
AS result;
"""

"\nSELECT 'SQL is cool'\nAS result;\n"

#### Beginning your SQL journey

In [5]:
# SQL => Structured Query Language
# language for interacting with data stored in a relational database
# collection of tables
# employees: id | name | age | nationality 

# rows -> records
# columns -> fields

# How many fields does the employees table above contain?
# 4 
# The table contains 4 coluns or fields

#### SELECTing single columns

In [6]:
# focus of querying databases
# A query is a request for data from a database table

# select data from table
# SELECT

# query selects the name column from the people table:
"""
SELECT name
FROM people;
"""
# keywords: SELECT | FROM
# keywords should be uppercase to distinguish from other parts of the query
# include semicolon (;) at the end of the query | tells Sql where the end of query is

# 1/3
# Select the title column from the films table.

"""
SELECT title
FROM films;
"""

# 2/3
# Select the release_year column from the films table.
"""
SELECT release_year
FROM films;
"""

# 3/3
# Select the name of each person in the people table.
"""
SELECT name
FROM people;
"""

'\nSELECT name\nFROM people;\n'

#### SELECTing multiple columns

In [7]:
# In the real world, you will often want to select multiple columns.
# To select multiple columns from a table, simply separate the column names with commas!

# query selects two columns, name and birthdate, from the people table:
"""
SELECT name, birthdate
FROM people;
"""
# select all columns from a table.
"""
SELECT *
FROM people;
"""

# If you only want to return a certain number of results, you can use the LIMIT keyword to limit the number of rows returned:

"""
SELECT *
FROM people
LIMIT 10;
"""

# films: id | title | release_year \ country | duration | language | certification | fross | budget

# 1/4
# Get the title of every film from the films table.
"""
SELECT title
FROM films;
"""

# 2/4
# Get the title and release year for every film.
"""
SELECT title, release_year
FROM films;
"""

# 3/4
# Get the title, release year and country for every film.
"""
SELECT title, release_year, country
FROM films;
"""

# 4/4
# Get all columns from the films table.
"""
SELECT *
FROM films;
"""

'\nSELECT *\nFROM films;\n'

#### SELECT DISTINCT

In [8]:
# results inculde duplicate values
# DISTINCT allows for selection of unique values

# useful if, for example, you're interested in knowing which languages are represented in the films table:
"""
SELECT DISTINCT language
FROM films;
"""

# 1/3
# Get all the unique countries represented in the films table.
"""
SELECT DISTINCT country 
FROM films; 
"""

# 2/3
# Get all the different film certifications from the films table.
"""
SELECT DISTINCT certification
FROM films;
"""

# 3/3
# Get the different types of film roles from the roles table.
"""
SELECT DISTINCT role
FROM roles;
"""
# query result
"""
role
director
actor
"""

'\nrole\ndirector\nactor\n'

#### Learning to COUNT

In [9]:
#  if you want to count the number of employees in your employees table, use COUNT() 
# COUNT() function returns the number of rows in one or more columns

# rows -> records
# columns -> fields

# this code gives the number of rows in the people table:
"""
SELECT COUNT(*)
FROM people;
"""
# 8397

# How many records are contained in the reviews table?
"""
SELECT COUNT(*)
FROM reviews; 
"""
# 4968

'\nSELECT COUNT(*)\nFROM reviews; \n'

#### Practice with COUNT

In [10]:
# COUNT(*) tells you how many rows, records are in a table.
# if you want to count the number of non-missing values in a particular column, you can call COUNT() on just that column.

# count the number of birth dates present in the people table:
"""
SELECT COUNT(birthdate)
FROM people; 
"""
# 6152

# also common to combine COUNT() with DISTINCT to count the number of distinct values in a column.
# this query counts the number of distinct birth dates contained in the people table:
"""
SELECT COUNT(DISTINCT birthdate)
FROM people; 
"""
# 5398

# 1/5
# Count the number of rows in the people table.
"""
SELECT COUNT(*)
FROM people; 
"""
# 8397

# 2/5
# Count the number of (non-missing) birth dates in the people table.
"""
SELECT COUNT(birthdate)
FROM people;
"""
# 6152

# 3/5
# Count the number of unique birth dates in the people table.
"""
SELECT COUNT(DISTINCT birthdate)
FROM people;
"""
# 5398

# 4/5
# Count the number of unique languages in the films table.
"""
SELECT COUNT(DISTINCT language)
FROM films;
"""
# 41

# 5/5
# Count the number of unique countries in the films table.
"""
SELECT COUNT(DISTINCT country)
FROM films; 
"""
# 64

'\nSELECT COUNT(DISTINCT country)\nFROM films; \n'

#### Filtering Results

In [ ]:
#  WHERE keyword allows you to filter based on both text and numeric values in a table
"""
comparison operators:
= equal
<> not equal
< less than
> greater than
<= less than or equal to
>= greater than or equal to
"""

# you can filter text records such as title

# code returns all films with the title 'Metropolis':
"""
SELECT title
FROM films
WHERE title = 'Metropolis';
"""
# WHERE comes after FROM

# SQL standard <> (course), !=; not equal 

# What does the following query return?
"""
SELECT title 
FROM films
WHERE release_year > 2000;
"""
# thought process:
# release_year greater than 2000 
# greater than 2001, ...
# after 
# release_year after 2000

# answer
# films released after the year 2000

#### Simple filtering of numeric values

In [ ]:
# recap
# WHERE clause can also be used to filter numeric records, such as years or ages.

# query selects all details for films with a budget over ten thousand dollars:
"""
SELECT *
FROM films
WHERE budget > 10000;
"""
# There are 108 film titles with a budget greater than $10,000

# use WHERE clause to filter numeric values

# films: id | title | release_year | country | duration | language | certification | gross | budget

# 1/3
# Get all details for all films released in 2016.
"""
SELECT * 
FROM films
WHERE release_year = 2016;
"""
# There are 4,920 films released in 2016.

# 2/3
# Get the number of films released before 2000.

# thought process:
# before 2000
# less than 
# x < 2000

"""
SELECT COUNT(*)
FROM films
WHERE release_year < 2000;
"""
# There are 1,337 films released before the year 2000.

# 3/3
# Get the title and release year of films released after 2000.
"""
SELECT title, release_year
FROM films
WHERE release_year > 2000;
"""

#### Simple filtering of text

In [ ]:
# WHERE clause can also be used to filter text results, such as names or countries.

# this query gets the titles of all films which were filmed in China:
"""
SELECT title
FROM films 
WHERE country = 'China';
"""

# WHERE with text values

# Important: in PostgreSQL (the version of SQL we're using), you must use single quotes with WHERE.

# 1/4
# Get all details for all French language films.
"""
SELECT *
FROM films 
WHERE language = 'French';
"""

# 2/4
# Get the name and birth date of the person born on November 11th, 1974. Remember to use ISO date format ('1974-11-11')!
"""
SELECT name, birthdate
FROM people 
WHERE birthdate = '1974-11-11';
"""
# Leonardo DiCaprio

# 3/4
# Get the number of Hindi language films.
"""
SELECT COUNT(*)
FROM films 
WHERE language = 'Hindi';
"""
# There are 28 films in the Hindi language.

# Thought process:
# number -> COUNT
# SELECT COUNT(*)
# FROM films
# WHERE language = 'Hindi';

# 4/4
# Get all details for all films with an R certification.
"""
SELECT *
FROM films
WHERE certification = 'R';
"""
# There are 2118 films with an 'R' certification 

# thought process:
# all details -> *
# SELECT *
# FROM films 
# WHERE certification = 'R';